"""Узнайте у пользователя целое положительное число n.
Найдите сумму чисел n + nn + nnn."""


<<<<<<< HEAD
n = input("Введите число n: ")
res = int(n) + int(n * n) + int(n * n * n)
print(f'Сумма чисел n + nn + nnn равна {res}')
=======
n = int(input("Введите число: "))
res = n + n*n + n*n*n
print(f"Сумма чисел n + nn + nnn равна {res}")
>>>>>>> Seminar1
