"""Узнайте у пользователя целое положительное число n.
Найдите сумму чисел n + nn + nnn."""

n = input("Введите число n: ")
res = int(n) + int(n * n) + int(n * n * n)
print(f'Сумма чисел n + nn + nnn равна {res}')
n = input("Введите число n: ")
res = int(n) + int(n * n) + int(n * n * n)
print(f'Сумма чисел n + nn + nnn равна {res}')